Public Attributes | List of all members
API_IFCPropertyTableValue Struct Reference
Element Manager API
IFC property with a list of value pairs. More...
#include <APIdefs_Properties.h>
 Public Attributes
GS::Array< API_IFCPropertyValue >  | definingValues
List of defning values, must be unique.
GS::Array< API_IFCPropertyValue >  | definedValues
List of defined values, does not have to be unique.
Detailed Description
IFC property with a list of value pairs.
Remarks
This structure contains a list of value pairs of an IfcPropertTableValue. The definingValues and definedValues shall have the same type inside, but the two types can differ. The size of the two arrays shall be the same, at least one pair of values shall be set.
Member Data Documentation
◆ definedValues
 API_IFCPropertyTableValue::definedValues
List of defined values, does not have to be unique.
◆ definingValues
 API_IFCPropertyTableValue::definingValues
List of defning values, must be unique.